Samraksh/eMote/MicroFrameworkPK_v4_0/Solutions/STM32F10x/DeviceCode/drivers/usb/netmf_usb.cpp
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) Microsoft Corporation.  All rights reserved.
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <usb/netmf_usb.h>
#include <intc/stm32.h>

// the v3.1 arm compiler optimizations for RTM cause the USB not to work
#if !defined(DEBUG)
#pragma O1
#endif

//USB Debug Flag
//#undef USB_DEBUG
//#define USB_NIVED_DEBUG
#undef USB_NIVED_DEBUG
//#define USB_DEBUG1
#undef USB_DEBUG1
//#define USB_DEBUG2
#undef USB_DEBUG2

USBCS_Driver g_USB_Driver;

USB_CONTROLLER_STATE UsbControllerState[1];     // Only 1 USB Controller for this device

Hal_Queue_KnownSize<USB_PACKET64,USB_QUEUE_PACKET_COUNT> QueueBuffers[USBCS_Driver::c_Used_Endpoints];

//Kartik : This points to the USB Configuration (UNION), need to remap!
//static USB_Driver::EndpointConfiguration EndpointInit[USBCS_Driver::c_Used_Endpoints];     // Corresponds to endpoint configuration RAM at PXA271_USB::UDCCRx

BOOL Send_Multiple_Packets = FALSE;
UINT32 State = IDLE;
int txCount=0;
//--//

//
//Kartik : Defining the STM Global Structures, which are called from usb_core
//
DEVICE Device_Table =
  {
    EP_NUM,
    1
  };

DEVICE_PROP Device_Property =
  {
    STM_USB_Init,
	STM_USB_Reset,
    STM_USB_Status_In,
    STM_USB_Status_Out,	
    STM_USB_Data_Setup,
    STM_USB_NoData_Setup,
    STM_USB_Get_Interface_Setting,
    STM_USB_GetDeviceDescriptor,
    STM_USB_GetConfigDescriptor,
    STM_USB_GetStringDescriptor,
	0,
    0x40 /*MAX PACKET SIZE*/
  };

USER_STANDARD_REQUESTS User_Standard_Requests =
  {
    STM_USB_GetConfiguration,
    STM_USB_SetConfiguration,
    STM_USB_GetInterface,
    STM_USB_SetInterface,
    STM_USB_GetStatus,
    STM_USB_ClearFeature,
    STM_USB_SetEndPointFeature,
    STM_USB_SetDeviceFeature,
    STM_USB_SetDeviceAddress
  };
//
//
void STM_USB_Init()
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_Init\n\r");
#endif
	//H/W init happens in the MF USB Init, just update state variables

	/* Update the serial number string descriptor with the data from the unique ID*/
	//Get_SerialNum();

	pInformation->Current_Configuration = 0;

	/* Connect the device */
	//PowerOn();

	/* Perform basic device initialization operations */
	//USB_SIL_Init();
	
	bDeviceState = UNCONNECTED;
}

void STM_USB_Reset()
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_Reset\n\r");
#endif

	/* Set the device as not configured */
	Device_Info.Current_Configuration = 0;

    /* Current Feature initialization */
    pInformation->Current_Feature = MASS_ConfigDescriptor[7];

    bDeviceState = ATTACHED;

	//CBW.dSignature = BOT_CBW_SIGNATURE;
	//Bot_State = BOT_IDLE;
	//USB_NotConfigured_LED();
}

void STM_USB_SetConfiguration(void)
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_SetConfiguration\n\r");
#endif

	if (pInformation->Current_Configuration != 0)
	{
		/* Device configured */
		bDeviceState = CONFIGURED;

		ClearDTOG_TX(ENDP1);
		ClearDTOG_RX(ENDP2);

		//Bot_State = BOT_IDLE; /* set the Bot state machine to the IDLE state */
	}
}

void STM_USB_ClearFeature(void)
{

#ifdef USB_DEBUG
	debug_printf("In STM_USB_ClearFeature\n\r");
#endif
	/* when the host send a CBW with invalid signature or invalid length the two
     Endpoints (IN & OUT) shall stall until receiving a Mass Storage Reset     */
	//if (CBW.dSignature != BOT_CBW_SIGNATURE)
	//Bot_Abort(BOTH_DIR);
}

void STM_USB_SetDeviceAddress (void)
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_SetDeviceAddress\n\r");
#endif
	bDeviceState = ADDRESSED;
}

void STM_USB_Status_In(void)
{
#ifdef USB_DEBUG
	debug_printf("In function STM_USB_Status_In\n\r\r");	
#endif
	return;
}

void STM_USB_Status_Out(void)
{
#ifdef USB_DEBUG
	debug_printf("In function STM_USB_Status_Out\n\r");
#endif
	return;
}

RESULT STM_USB_Data_Setup(uint8_t RequestNo)
{
	//debug_printf("In STM_USB_Data_Setup\n\r");
#ifdef USB_DEBUG2
	debug_printf("In STM_USB_Data_Setup\n\r");
#endif
#if 0
	uint8_t    *(*CopyRoutine)(uint16_t);

	CopyRoutine = NULL;
	if ((Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT)) && (RequestNo == GET_MAX_LUN) && (pInformation->USBwValue == 0)
      && (pInformation->USBwIndex == 0) && (pInformation->USBwLength == 0x01))
	{
		CopyRoutine = Get_Max_Lun;
	}
	else
	{
		return USB_UNSUPPORT;
    }

	if (CopyRoutine == NULL)
	{
		return USB_UNSUPPORT;
	}

	pInformation->Ctrl_Info.CopyData = CopyRoutine;
	pInformation->Ctrl_Info.Usb_wOffset = 0;
	(*CopyRoutine)(0);
#endif
	return USB_SUCCESS;
}

RESULT STM_USB_NoData_Setup(uint8_t RequestNo)
{
	//debug_printf("In STM_USB_NoData_Setup\n\r");
#ifdef USB_DEBUG2
	debug_printf("In STM_USB_NoData_Setup\n\r");
#endif
#if 0
	if ((Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))
      && (RequestNo == MASS_STORAGE_RESET) && (pInformation->USBwValue == 0)
      && (pInformation->USBwIndex == 0) && (pInformation->USBwLength == 0x00))
	{
		/* Initialize Endpoint 1 */
		ClearDTOG_TX(ENDP1);

		/* Initialize Endpoint 2 */
		ClearDTOG_RX(ENDP2);  

		/*initialize the CBW signature to enable the clear feature*/
		//CBW.dSignature = BOT_CBW_SIGNATURE;
		//Bot_State = BOT_IDLE;

		return USB_SUCCESS;
	}
	return USB_UNSUPPORT;
#endif	
	return USB_SUCCESS;
}

RESULT STM_USB_Get_Interface_Setting(uint8_t Interface, uint8_t AlternateSetting)
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_Get_Interface_Setting\n\r");
#endif
	
	if (AlternateSetting > 0)
	{
		return USB_UNSUPPORT;/* in this application we don't have AlternateSetting*/
	}
	else if (Interface > 0)
	{
		return USB_UNSUPPORT;/*in this application we have only 1 interfaces*/
	}
	
	return USB_SUCCESS;
}

uint8_t* STM_USB_GetDeviceDescriptor(uint16_t Length)
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_GetDeviceDescriptor\n\r");
#endif	

#ifdef USB_NIVED_DEBUG
	debug_printf("In STM_USB_GetDeviceDescriptor\n\r");
#endif

	return Standard_GetDescriptorData(Length, &Device_Descriptor );
}

uint8_t* STM_USB_GetConfigDescriptor(uint16_t Length)
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_GetConfigDescriptor\n\r");
#endif	
#ifdef USB_NIVED_DEBUG
	debug_printf("In STM_USB_GetConfigDescriptor\n\r");
#endif

	return Standard_GetDescriptorData(Length, &Config_Descriptor );
}

uint8_t* STM_USB_GetStringDescriptor(uint16_t Length)
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_GetStringDescriptor\n\r");
#endif
#ifdef USB_NIVED_DEBUG
	debug_printf("In STM_USB_GetStringDescriptor\n\r");
#endif
	
	
