Samraksh/eMote/MicroFrameworkPK_v4_0/Solutions/STM32F10x/DeviceCode/drivers/usb/netmf_usb.cpp
	uint8_t wValue0 = pInformation->USBwValue0;	

	if (wValue0 > 5)
	{
	   return NULL;
	}
	else
	{
		return Standard_GetDescriptorData(Length, &String_Descriptor[wValue0]);
	}
}

uint8_t* Get_Max_Lun(uint16_t Length)
{
#ifdef USB_DEBUG
	debug_printf("In Get_Max_Lun\n\r");
#endif
	if (Length == 0)
	{
		pInformation->Ctrl_Info.Usb_wLength = LUN_DATA_LENGTH;
		return 0;
	}
	else
	{
	    return((uint8_t*)(&Max_Lun));
	}
}

void STM_USB_GetConfiguration()
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_GetConfiguration\n\r");
#endif
}

void STM_USB_GetInterface()
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_GetInterface\n\r");
#endif
}

void STM_USB_SetInterface()
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_SetInterface\n\r");
#endif
}

void STM_USB_GetStatus()
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_GetStatus\n\r");
#endif
}

void STM_USB_SetEndPointFeature()
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_SetEndPointFeature\n\r");
#endif
}

void STM_USB_SetDeviceFeature()
{
#ifdef USB_DEBUG
	debug_printf("In STM_USB_SetDeviceFeature\n\r");
#endif
}


//
//NET MF Functions
//
USB_CONTROLLER_STATE* USBCS_Driver::GetState( int Controller )
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::GetState\n\r");
#endif

    if( Controller != 0 )       // There is only one controller for this device
        return NULL;
    return &UsbControllerState[0];
}

HRESULT USBCS_Driver::Initialize( int Controller )
{   
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::Initialize\n\r");
#endif	

	int endpointsUsed = 0;

    const USB_ENDPOINT_DESCRIPTOR  *ep    = NULL;
    const USB_INTERFACE_DESCRIPTOR *itfc  = NULL;

	USB_CONTROLLER_STATE &State = UsbControllerState[0];
	ASSERT(0 == Controller);	

	//Set up GPIO
	Set_System();
	//Enable Clock
	USB_Clock();
	//Enable uC Interrupts
	USB_Interrupts_Config();

	/* Connect the device */
	StartHardware();
	
	/* Perform basic device initialization operations */
	USB_SIL_Init();

	//Initialize STM state data structures
	pInformation = &Device_Info;
	pInformation->ControlState = 2;
	pProperty = &Device_Property;
	pUser_Standard_Requests = &User_Standard_Requests;
	/* Initialize devices one by one */
	pProperty->Init();

	//TODO: Initialize all end points to unused
	//debug_printf("In USBCS_Driver::Initialize Entering initialization");
	//Configure other end points (endpoint no 1)
	while( USB_NextEndpoint( &State, ep, itfc) ) // && logicalEndpoint < 11 )
    {
        // Figure out which endpoint we are initializing
        UINT8 endpointNum = ep->bEndpointAddress & 0x7F;

		UINT16 endpointSize = ep->wMaxPacketSize;
        
        // Check interface and endpoint numbers against hardware capability
        if( endpointNum >= USBCS_Driver::c_Used_Endpoints || itfc->bInterfaceNumber > 3 )
            return S_FALSE;

	    // Set the maximum size of the endpoint hardware FIFO
        if( (ep->bmAttributes & 0x03) == USB_ENDPOINT_ATTRIBUTE_BULK )
        {
			if( endpointSize != 8 && endpointSize != 16 && endpointSize != 32 && endpointSize != 64 )
			{
				return S_FALSE;
			}
            //TODO : Move this value (endpointSize) to the packet size in the EP register
			State.MaxPacketSize[endpointNum]   = endpointSize;
		}
		else if( (ep->bmAttributes & 0x03) == USB_ENDPOINT_ATTRIBUTE_INTERRUPT )
        {
            if( endpointSize == 0 || endpointSize > 64 )
			{
                return S_FALSE;
			}
            //TODO : Move this value (endpointSize) to the packet size in the EP register
            State.MaxPacketSize[endpointNum]   = endpointSize;
        }
        else        // Isochronous endpoint
        {
            if( endpointSize > 64 )
                endpointSize = 64;
            //TODO : Move this value (endpointSize) to the packet size in the EP register
            State.MaxPacketSize[endpointNum]   = endpointSize;
        }

		// Since endpoint 0 is only used for control, there is never a need to allocate a buffer for it
        // In fact State.Queues[0] is always NULL - it is a cheap placeholder to make the queueIndex = endpointIndex
        QueueBuffers[endpointNum-1].Initialize();                       // Clear queue before use
        State.Queues[endpointNum] = &QueueBuffers[endpointNum-1];       // Attach queue to endpoint

		if( (ep->bEndpointAddress & 0x80) ? 1 : 0 )        // If transmit endpoint
        {
            State.IsTxQueue[endpointNum] = TRUE;
			//TODO : Enable the interrupt for the end point, based on the KIND (ep->bmAttributes & 0x03)
			//TODO : Set direction of the end point
		}
		else        // Receive endpoint
        {
            State.IsTxQueue[endpointNum] = FALSE;
			//TODO : Enable the interrupt for the end point, based on the KIND (ep->bmAttributes & 0x03)
			//TODO : Set direction of the end point
		}

		//endpointsUsed++;
		debug_printf("In USBCS_Driver::Initialize endpoint number: %d\n\r", endpointNum);
	}

    g_USB_Driver.pUsbControllerState  = &State;
    g_USB_Driver.PinsProtected        = TRUE;

    State.EndpointStatus = &g_USB_Driver.EndpointStatus[0];
    State.EndpointCount  = c_Used_Endpoints;
    //State->DeviceStatus   = USB_STATUS_DEVICE_SELF_POWERED;
    State.PacketSize     = c_default_ctrl_packet_size;
    
    State.FirstGetDescriptor = TRUE;
	//State.Initialized=TRUE;

	//SetEPRxStatus(EP2_OUT, EP_RX_VALID);

	//Kartik : Commented for now
    //ProtectPins( Controller, FALSE );
    //LED_GREEN();
    return S_OK;    
}

HRESULT USBCS_Driver::Uninitialize( int Controller )
{ 
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::Uninitialize\n\r");
#endif

    ASSERT( 0 == Controller );
    
    GLOBAL_LOCK(irq);

    ProtectPins( Controller, TRUE );

    g_USB_Driver.pUsbControllerState = NULL;

	//TODO : Disable Interrupts 
	//TODO : Disable Clocks

    return S_OK;
}

BOOL USBCS_Driver::StartOutput( USB_CONTROLLER_STATE* State, int endpoint )
{ 
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::StartOutput\n\r");
#endif
/*
#if 0
	// If endpoint is not an output
	if( State->Queues[endpoint] == NULL || !State->IsTxQueue[endpoint] )
		return FALSE;

