Samraksh/eMote/MicroFrameworkPK_v4_0/Solutions/STM32F10x/DeviceCode/drivers/usb/netmf_usb.cpp
	GLOBAL_LOCK(irq);


	// if the halt feature for this endpoint is set, then just
	      //clear all the characters
	if(State->EndpointStatus[endpoint] & USB_STATUS_ENDPOINT_HALT)
	{
		ClearTxQueue( State, endpoint );
		return TRUE;
	}

//	USB_PACKET64* Packet64;
//	Packet64 = USB_TxDequeue( State, endpoint, TRUE );
//	USB_SIL_Write(EP1_IN, (uint8_t*) Packet64->Buffer, Packet64->Size);
//	SetEPTxValid(ENDP1);
//	SetEPRxStatus(ENDP2, EP_RX_VALID);


#endif
*/

//#if 0
    ASSERT( State );
    ASSERT(endpoint < c_Used_Endpoints);

    //GLOBAL_LOCK(irq);

    // If endpoint is not an output
    if( State->Queues[endpoint] == NULL || !State->IsTxQueue[endpoint] )
        return FALSE;

    /* if the halt feature for this endpoint is set, then just
       clear all the characters */
    if(State->EndpointStatus[endpoint] & USB_STATUS_ENDPOINT_HALT)
    {
        ClearTxQueue( State, endpoint );
        return TRUE;
    }

    //transmit all packets in the send buffer
    //while(~(State->Queues[endpoint]->IsEmpty())){
    	//TxPacket( State, endpoint );
    	EP_TxISR(endpoint);
    //}

    //Check other endpoints for pending actions
   /* if(irq.WasDisabled()){
    	CTR_LP();
    }*/

   /* for( int ep = 1; ep < c_Used_Endpoints; ep++ )
   	{
		// If no interrupt for this endpoint
		//if( (((USB.UDCISR0 & USB.UDCICR0) >> (ep * 2)) & USB.UDCICR__BOTH) == 0 )
			//continue;

		if(State->Queues[ep])
		{
			if( State->IsTxQueue[endpoint] )
				EP_TxISR( endpoint );
			else
				EP_RxISR( endpoint );
		}
	}
*/


/*
    //If TxRunning, interrupts will drain the queue
    if(!g_USB_Driver.TxRunning[endpoint])
    {
        g_USB_Driver.TxRunning[endpoint] = TRUE;

        // Calling both TxPacket & EP_TxISR in this routine could cause a TX FIFO overflow
        TxPacket( State, endpoint );
    }
    else if(irq.WasDisabled())
    {                        

        // This could be called during Flush with all interrupts off.  Just taking care of the endpoint
        // in question may cause a logjam if the host is expecting a response from another endpoint.

    	//Check All endpoints for activity.
    	//Call the main interrupt handler, this will take care of pending interrupts
    	CTR_LP();

    	/*
        if( USB.UDCISR0 & USB.UDCICR0 & USB.UDCICR__BOTH )        // If endpoint 0 needs attention
            EP0_ISR( 0 );
        for( int ep = 1; ep < c_Used_Endpoints; ep++ )
        {
            // If no interrupt for this endpoint
            if( (((USB.UDCISR0 & USB.UDCICR0) >> (ep * 2)) & USB.UDCICR__BOTH) == 0 )
                continue;

            if(State->Queues[ep])
            {
                if( State->IsTxQueue[endpoint] )
                    EP_TxISR( endpoint );
                else
                    EP_RxISR( endpoint );
            }
        }
    }*/
//#endif
    return TRUE;

}

BOOL USBCS_Driver::GetInterruptState()
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::GetInterruptState\n\r");
#endif

    GLOBAL_LOCK(irq);

    if(GetISTR()) 
    {
        return TRUE;
    }
    
    return FALSE;
}

/*
BOOL USBCS_Driver::SetInterruptState(int EndPoint, uint32 Interrupt)
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::SetInterruptState\n\r");
#endif

    GLOBAL_LOCK(irq);

    UINT32 mask = 3;
    int    shift;

    ASSERT(EndPoint < c_MaxEndpoints);

    if(EndPoint < 16)
    {
        shift = EndPoint * 2;
        mask <<= shift;
        UDCICR0 = (UDCICR0 & ~mask) | (interrupt << shift);
    }
    else
    {
        shift = (EndPoint - 16) * 2;
        mask <<= shift;
        UDCICR1 = (UDCICR1 & ~mask) | (interrupt << shift);
    }
    return FALSE;
}
*/

//--//

void USBCS_Driver::ClearTxQueue( USB_CONTROLLER_STATE* State, int endpoint )
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::ClearTxQueue\n\r");
#endif

    ASSERT(State);    
    State->Queues[endpoint]->Initialize();
}

//--//
void USBCS_Driver::StartHardware()
{       
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::StartHardware\n\r");
#endif
  uint16_t wRegVal;
  
  /*** cable plugged-in ? ***/
  /*while(!CablePluggedIn());*/
  USB_Cable_Config(ENABLE);

  /*** CNTR_PWDN = 0 ***/
  wRegVal = CNTR_FRES;
  _SetCNTR(wRegVal);

  /*** CNTR_FRES = 0 ***/
  wInterrupt_Mask = 0;
  _SetCNTR(wInterrupt_Mask);
  /*** Clear pending interrupts ***/
  _SetISTR(0);
  /*** Set interrupt mask ***/
  wInterrupt_Mask = CNTR_RESETM | CNTR_SUSPM | CNTR_WKUPM | CNTR_ERRM; //| CNTR_CTRM | CNTR_DOVRM | CNTR_ESOFM | CNTR_SOFM | CNTR_RESUME | CNTR_FSUSP | CNTR_LPMODE | CNTR_PDWN | CNTR_FRES;
  _SetCNTR(wInterrupt_Mask);
}

/*
This functions turns off the USB core
*/
void USBCS_Driver::StopHardware()
{    
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::StopHardware\n\r");
#endif
	SetCNTR(CNTR_PDWN);
}

void USBCS_Driver::TxPacket( USB_CONTROLLER_STATE* State, int endpoint )
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::TxPacket\n\r");
#endif

    ASSERT( endpoint < c_Used_Endpoints );    
    ASSERT( State );

    GLOBAL_LOCK(irq); 

    // transmit a packet on UsbPortNum, if there are no more packets to transmit, then die    

    // If this is not a legal transmit endpoint, there is nothing to do
    if( State->Queues[endpoint] == NULL || !State->IsTxQueue[endpoint] )
        return;

    //Why infinte for loop
    /*for(;;)
     {
         Packet64 = USB_TxDequeue( State, endpoint, TRUE );

         if( Packet64 == NULL || Packet64->Size > 0 )
             break;
     }
*/

    USB_PACKET64* Packet64;
    Packet64 = USB_TxDequeue( State, endpoint, TRUE );

    if( Packet64 )
    {
    	 USB_SIL_Write(EP1_IN, (uint8_t*) Packet64->Buffer, Packet64->Size);
    	 SetEPTxValid(ENDP1);
    	 txCount++;
    	 if(txCount % 2 ==0){
    		 LED_BLUE();
    	 }else {
    		 LED_BLUE_OFF();
    	 }

    	 SetEPRxStatus(ENDP2, EP_RX_VALID);
		
		if (Packet64->Size > BULK_MAX_PACKET_SIZE)
		{
			//Data needs to be packetized and sent			
			Send_Multiple_Packets = TRUE;
			LED_GREEN_OFF();
		}
        else
		{
			//can be sent in one transfer
			Send_Multiple_Packets = FALSE;						
		}


        //while( nLeft >= 4 )
        //{
			// Shove packet into FIFO 4 bytes at a time
            //USB.UDCDRx[endpoint] = *packet4++;                  
        //    nLeft -= 4;
        //}
		
		//Send_Data();

		// If packet is not the full size
        //if( Packet64->Size < State->MaxPacketSize[endpoint] )   
        //{
        //    UINT16* packet2 = (UINT16*)packet4;
            
        //    if( nLeft >= 2 )
        //    {
                //*(volatile UINT16*)&USB.UDCDRx[endpoint] = *packet2++;
        //        nLeft -= 2;
        //    }
        //    if( nLeft > 0)
        //    {
                //*(volatile UINT8*)&USB.UDCDRx[endpoint] = *(UINT8*)packet2;
        //    }
			// Send a short packet (full length packets are automatically sent)
            //USB.UDCCSRx[endpoint] = USB.UDCCSR__SP;             
        //}

        //g_USB_Driver.TxNeedZLPS[endpoint] = (Packet64->Size == State->MaxPacketSize[endpoint]);
    }


