Samraksh/eMote/MicroFrameworkPK_v4_0/Solutions/STM32F10x/DeviceCode/drivers/usb/netmf_usb.cpp
   /* else
    {
        // send the zero length packet since we landed on the FIFO boundary before
        // (and we queued a zero length packet to transmit) 
        if(g_USB_Driver.TxNeedZLPS[endpoint])
        {
			// If a packet has been sent
            //if(USB.UDCCSRx[endpoint] & USB.UDCCSR__PC)              
			//{
				// Clear the Packet Complete bit
				//USB.UDCCSRx[endpoint] = USB.UDCCSR__PC;             
			//}
            
            
			// We should absolutely have an empty buffer to use
            //ASSERT((USB.UDCCSRx[endpoint] & USB.UDCCSR__FS) != 0);  

			// Send a short (zero length) packet            
			SetEPTxCount(ENDP1, 0); 
			//vSetEPTxStatus(EP_TX_VALID);			
            g_USB_Driver.TxNeedZLPS[endpoint] = FALSE;
        }

        // no more data
        g_USB_Driver.TxRunning[endpoint] = FALSE;
    }
	*/
}



void USBCS_Driver::ControlNext()
{    
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::ControlNext");
#endif

    ASSERT(g_USB_Driver.pUsbControllerState);
    //PXA271_USB& USB = PXA271::USB();
    USB_CONTROLLER_STATE *State = g_USB_Driver.pUsbControllerState;

    if( State->DataCallback )
    {
        /* this call can't fail */
        State->DataCallback( State );


        if( State->DataSize == 0 )
        {
			// Send zero length packet
            //USB.UDCCSRx[0] = PXA271_USB::UDCCSR__IPR;         
			// Stop sending stuff if we're done
            State->DataCallback = NULL;                         
        }
        else
        {
			// FIFO may only be loaded with full words
            UINT32* packet4 = (UINT32*)State->Data;             
            int     nLeft   = State->DataSize;
            while( nLeft >= 4 )
            {
				// Shove packet into FIFO 4 bytes at a time
                //USB.UDCDRx[0] = *packet4++;                     
                nLeft -= 4;
            }

			// If packet is less than full length
            if(State->DataSize < c_default_ctrl_packet_size)    
            {
                UINT16* packet2 = (UINT16*)packet4;
                
                if( nLeft >= 2 )
                {
                    //*(volatile UINT16*)&USB.UDCDRx[0] = *packet2++;
                    nLeft -= 2;
                }
                if( nLeft > 0)
                {
                    //*(volatile UINT8*)&USB.UDCDRx[0] = *(UINT8*)packet2;
                }
				// Send a short packet (full length packets are automatically sent)
                //USB.UDCCSRx[0] = USB.UDCCSR__IPR;

				// Stop sending stuff if we're done
                State->DataCallback = NULL;                     
            }


            // special handling the USB driver set address test, cannot use the first descriptor as the ADDRESS state is handle in the hardware
            if(g_USB_Driver.FirstDescriptorPacket)
            {
                State->DataCallback = NULL;
            }

       }
    }


}

void USBCS_Driver::SuspendEvent()
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::SuspendEvent");
#endif

    ASSERT(g_USB_Driver.pUsbControllerState);

    //PXA271_USB& USB = PXA271::USB();
    
	USB_CONTROLLER_STATE *State = g_USB_Driver.pUsbControllerState;

    // SUSPEND event only happened when Host(PC) set the device to SUSPEND
    // as there is always SOF every 1ms on the BUS to keep the device from
    // suspending. Therefore, the REMOTE wake up is not necessary at the ollie side

    //USB.UDCICR1 = PXA271_USB::UDCICR1__IECC | PXA271_USB::UDCICR1__IERS | PXA271_USB::UDCICR1__IERU | PXA271_USB::UDCICR1__IESU;

    g_USB_Driver.PreviousDeviceState = State->DeviceState;

    State->DeviceState = USB_DEVICE_STATE_SUSPENDED;

    USB_StateCallback( State );

#if defined(DEBUG_USB)
    USB_debug_printf("In suspend event previous %d\n\r\r", g_USB_Driver.PreviousDeviceState);
#endif    
}

void USBCS_Driver::ResumeEvent()
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::ResumeEvent\n\r");
#endif

	ASSERT(g_USB_Driver.pUsbControllerState);
	USB_CONTROLLER_STATE *State = g_USB_Driver.pUsbControllerState;

#if defined(DEBUG_USB)
    USB_debug_printf(" in Resume\r\n\r");
#endif

    //USB.UDCICR1 = PXA271_USB::UDCICR1__IECC | PXA271_USB::UDCICR1__IERS | PXA271_USB::UDCICR1__IERU | PXA271_USB::UDCICR1__IESU;

    State->DeviceState = g_USB_Driver.PreviousDeviceState;

    USB_StateCallback( State );
}



void USBCS_Driver::ResetEvent()
{
#ifdef USB_DEBUG1
	debug_printf("In USBCS_Driver::ResetEvent\n\r\r");
#endif

	//Call to the STM function
	Device_Property.Reset();

	USB_CONTROLLER_STATE *State = g_USB_Driver.pUsbControllerState;
	// The hardware handles most of the reset procedure.

	SetBTABLE(BTABLE_ADDRESS);
	// Initialize Endpoint 0 
	SetEPType(ENDP0, EP_CONTROL);
	SetEPTxStatus(ENDP0, EP_TX_NAK);
	SetEPRxAddr(ENDP0, ENDP0_RXADDR);
	SetEPRxCount(ENDP0, 0x40);
	SetEPTxAddr(ENDP0, ENDP0_TXADDR);
	Clear_Status_Out(ENDP0);
	SetEPRxValid(ENDP0);

    /* Initialize Endpoint 1 */
    SetEPType(ENDP1, EP_BULK);
    SetEPTxAddr(ENDP1, ENDP1_TXADDR);
    SetEPTxStatus(ENDP1, EP_TX_NAK);
    SetEPRxStatus(ENDP1, EP_RX_DIS);

    /* Initialize Endpoint 2 */
    SetEPType(ENDP2, EP_BULK);
    SetEPRxAddr(ENDP2, ENDP2_RXADDR);
    SetEPRxCount(ENDP2, 0x40);
    SetEPTxStatus(ENDP2, EP_TX_DIS);
    Clear_Status_Out(ENDP2);
    SetEPRxStatus(ENDP2, EP_RX_VALID);



    /* Initialize Endpoint 3
    SetEPType(ENDP3, EP_BULK);
    SetEPRxAddr(ENDP3, ENDP3_RXADDR);
    SetEPRxCount(ENDP3, 0x40);
    SetEPRxStatus(ENDP3, EP_RX_VALID);
    SetEPTxStatus(ENDP3, EP_TX_DIS);
	*/
    SetEPRxCount(ENDP0, 0x40);
    SetEPRxValid(ENDP0);

    /* Set the device to response on default address */
    SetDeviceAddress(0);


	/* clear all flags */
    USB_ClearEvent( 0, USB_EVENT_ALL);

#if defined(DEBUG_USB)
    USB_debug_printf(" in Reset\r\n\r");

    if( State->DeviceState >= USB_DEVICE_STATE_ADDRESS )
    {
        static int count = 0;
        USB_debug_printf("\fRESET: %d  \r\n\r", ++count);
    }
#endif

    for(int ep = 0; ep < c_Used_Endpoints; ep++)
    {
        g_USB_Driver.TxRunning [ep] = FALSE;
        g_USB_Driver.TxNeedZLPS[ep] = FALSE;
    }


    State->DeviceState        = USB_DEVICE_STATE_DEFAULT;
    State->Address            = 0;
    USB_StateCallback( State );    

