Samraksh/eMote/MicroFrameworkPK_v4_0/Solutions/STM32F10x/DeviceCode/drivers/usb/netmf_usb.cpp
}

//--//

BOOL USBCS_Driver::RxEnable( USB_CONTROLLER_STATE *State, int endpoint )
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::RxEnable\n\r");
#endif

	if( NULL == State || endpoint >= c_Used_Endpoints )
        return FALSE;
    
    GLOBAL_LOCK(irq);

    /* unmask receive event */
    //USB.Set_Interrupt(endpoint, PXA271_USB::UDCICR__BOTH);      // Enable both interrupts for this endpoint


    //Mukundan added lines, line below
    //USB_Debug("e");

    // If this is not a legal Rx queue
    if( State == NULL || State->Queues[endpoint] == NULL || State->IsTxQueue[endpoint] )
        return FALSE;

    // enable Rx
    // if the current endpoint register is in RX_NAK and there are no interrupt pending for ENDP0
    if ((_GetENDPOINT(endpoint) & ((_GetENDPOINT(0) & EP_CTR_RX) | _GetEPRxStatus(0))) == EP_RX_NAK) {
        // Nak & no int pending // !!!
    	_SetEPRxValid(endpoint);
    }



    return TRUE;        
}

BOOL USBCS_Driver::ProtectPins( int Controller, BOOL On )
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::ProtectPins\n\r");
#endif

    ASSERT( 0 == Controller );
    USB_CONTROLLER_STATE *State = g_USB_Driver.pUsbControllerState;
    
    GLOBAL_LOCK(irq);

    // Initialized yet?
    if( State )
    {
        if( On )
        {
            if(!g_USB_Driver.PinsProtected)
            {
                // Disable the USB com, state change from Not protected to Protected

                g_USB_Driver.PinsProtected = TRUE;

                // clear USB Txbuffers
                for(int ep = 0; ep < c_Used_Endpoints; ep++)
                {
                    if( State->IsTxQueue[ep] )
                        ClearTxQueue( State, ep );
                }

                // stop clock, disable interrupt, dettach USB port
                // set the USBBus->DeviceState = DETACHED
				//Kartik: Set the correct pin number here; For signalling the host
                //CPU_GPIO_EnableInputPin(PXA271_USB::c_USBC_GPIOX_EN, FALSE, NULL, GPIO_INT_NONE, RESISTOR_DISABLED);     // Disable host signal driver
                State->DeviceState = USB_DEVICE_STATE_DETACHED;
                USB_StateCallback( State );

#if defined(DEBUG_USB)
                USB_debug_printf(" DETACHED USB in protect pin\n\r\r");
                lcd_printf("Detached USB in protect pin\n\r\r");
#endif
                StopHardware();
            }
        }
        else
        {
            if( g_USB_Driver.PinsProtected )
            {
                // Ready for USB to enable, state change from Protected to Not protected
                g_USB_Driver.PinsProtected = FALSE;

                // enable the clock,
                // set USB to attached/powered
                // set the device to a known state- Attached before it is set to the powered state (USB specf 9.1.1)

                //CPU_GPIO_EnableInputPin(PXA271_USB::c_USBC_GPION_DET, FALSE, NULL, GPIO_INT_NONE, RESISTOR_DISABLED);
                //CPU_GPIO_EnableOutputPin(PXA271_USB::c_USBC_GPIOX_EN, FALSE);       // Don't signal the host yet
                
				State->DeviceState = USB_DEVICE_STATE_ATTACHED;
                
                USB_StateCallback( State );

                StartHardware();
            }
        }

        return TRUE;
    }
    else
    {
        return FALSE;
    }
}

void USBCS_Driver::Global_ISR( void* Param )
{ 
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::Global_ISR\n\r");
#endif
}


void USBCS_Driver::EP0_ISR( UINT32 Param )
{   
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::EP0_ISR\n\r");
#endif 
}

//void EP1_IN_Callback()
void USBCS_Driver::EP_TxISR( UINT32 endpoint )
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::EP_TxISR\n\r");
#endif    		
	TxPacket( g_USB_Driver.pUsbControllerState, endpoint );
	//LED_BLUE();
}

void USBCS_Driver::EP_RxISR( UINT32 endpoint )
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::EP_RxISR\n\r");
#endif    	
	ASSERT(endpoint < c_Used_Endpoints);
	ASSERT(g_USB_Driver.pUsbControllerState);
	ASSERT((_GetENDPOINT(endpoint) & EPRX_STAT) == EP_RX_NAK);

	USB_CONTROLLER_STATE *State = g_USB_Driver.pUsbControllerState;

	BOOL full;
	USB_PACKET64* Packet64 = USB_RxEnqueue( State, endpoint, full );
	int count=0;
	/* copy packet in, making sure that Packet64->Buffer is never overflowed */
	if (Packet64) {
		//USB_Debug("r");

		// copy buffer
		count=USB_SIL_Read(_GetEPAddress(endpoint), (uint8_t *)Packet64->Buffer);
		Packet64->Size = count;
		if (!full) { // reenable Rx
			_SetEPRxValid(endpoint);
		} else {
			debug_printf("buffer full");
			SetEPRxStatus(EP2_OUT,EP_RX_STALL);
		}
	} else {  // should not happen
		//USB_Debug("?");
		ASSERT(0);
	}

	//Check other endpoints for pending actions
    for( int ep = 1; ep < c_Used_Endpoints; ep++ )
   	{
		// If no interrupt for this endpoint
		//if( (((USB.UDCISR0 & USB.UDCICR0) >> (ep * 2)) & USB.UDCICR__BOTH) == 0 )
			//continue;

		if(State->Queues[ep])
		{
			if( State->IsTxQueue[endpoint] )
				EP_TxISR( endpoint );
		}
	}

	//char reply[count]=Packet64->Buffer
	/*debug_printf("In USBCS_Driver::EP_RxISR::Reply:: ");
	for (int i=count-1; i>=0; i--){
		debug_printf("-%c-%c", Packet64->Buffer[i],Packet64->Buffer[i-1]);
		//i--;
	}
	debug_printf("\n\r");
	*/
	//LED_GREEN();
}

BOOL USBCS_Driver::USB_Interrupts_Config()
{
#ifdef USB_DEBUG
	debug_printf("In USBCS_Driver::USB_Interrupts_Config\n\r");
#endif

	//Replace with calls to Interrupt controller

	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	//NVIC_Init(&NVIC_InitStructure);
	if( !CPU_INTC_ActivateInterrupt( STM32_AITC::c_IRQ_INDEX_USB_LP_CAN_RX0, (HAL_CALLBACK_FPN)  usb_irq_handler, (void *)NULL) ) return FALSE;

	NVIC_InitStructure.NVIC_IRQChannel = USB_HP_CAN1_TX_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	//NVIC_Init(&NVIC_InitStructure);
	if( !CPU_INTC_ActivateInterrupt( STM32_AITC::c_IRQ_INDEX_USB_HP_CAN_TX  , (HAL_CALLBACK_FPN) CTR_HP, (void *)NULL) ) return FALSE;
}

void USBCS_Driver::USB_Clock()
{
#ifdef USB_DEBUG
	debug_printf("In USB_Clock\n\r");
#endif

	//Run at 48MhzsL 72Mhzs PLL prescaled by 1.5
	//RCC_USBCLKConfig(RCC_USBCLKSource_PLLCLK_1Div5);
	RCC_USBCLKConfig(RCC_USBCLKSource_PLLCLK_Div1 );
	/* Enable the USB clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USB, ENABLE);
}

void USBCS_Driver::Set_System()
{
#ifdef USB_DEBUG
	debug_printf("In Set_System\n\r");
#endif

	GPIO_InitTypeDef GPIO_InitStructure;
	//This configuration sets the USB GPIO to not use USB_USE_EXTERNAL_PULLUP, the external Pull up has a different configurations
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_DISCONNECT, ENABLE);

