Samraksh/eMote/MicroFrameworkPK_v4_0/Solutions/STM32F10x/DeviceCode/drivers/usb/netmf_usb.cpp
    /* Configure USB pull-up pin */

	//Dev board disconnect
    /*GPIO_InitStructure.GPIO_Pin = USB_DISCONNECT_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
    GPIO_Init(USB_DISCONNECT, &GPIO_InitStructure);
	*/

	/*Emote USB 5v regulator
    GPIO_InitStructure.GPIO_Pin = USB_DISCONNECT_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    GPIO_WriteBit(GPIOB,USB_CONNECT_PIN, Bit_SET );

    //port C
    //EMote Bus disconnect
    GPIO_InitStructure.GPIO_Pin = USB_EMOTE_BD_PIN ;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(USB_EMOTE_BD_PORT, &GPIO_InitStructure);
	*/

    //GPIO_WriteBit(GPIOC,13, Bit_SET );
    //GPIO_WriteBit(GPIOF,11, Bit_SET );
}

void USBCS_Driver::USB_Cable_Config(bool state)
{
#ifdef USB_DEBUG
	debug_printf("In USB_Cable_Config\n\r");
#endif

  if (state != false)
  {
    GPIO_ResetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
  }
  else
  {
    GPIO_SetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
  }
}

//GLobal ISR for the USB
void usb_irq_handler(void* Param)
{
	
#ifdef USB_DEBUG
	//debug_printf("In the USB Handler\n\r");
#endif	
	wIstr = _GetISTR();
//LED_ORANGE();

#if (IMR_MSK & ISTR_CTR)
  if (wIstr & ISTR_CTR & wInterrupt_Mask)
  {
    /* servicing of the endpoint correct transfer interrupt */
    /* clear of the CTR flag into the sub */
#ifdef USB_DEBUG
	debug_printf("\nGoing to call CTR_LP\n\r");
#endif	
	//LED_BLUE();
    CTR_LP();
#ifdef CTR_CALLBACK
    CTR_Callback();
#endif
  }
#endif  
  /*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*/
#if (IMR_MSK & ISTR_RESET)
  if (wIstr & ISTR_RESET & wInterrupt_Mask)
  {
#ifdef USB_DEBUG
	debug_printf("\nGoing to call RESET\n\r");
#endif	
    _SetISTR((uint16_t)CLR_RESET);
	//Kartik : Calling this function from the ResetEvent to update state
    //Device_Property.Reset();
	USBCS_Driver::ResetEvent();
#ifdef RESET_CALLBACK
    RESET_Callback();
#endif
  }
#endif
  /*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*/
#if (IMR_MSK & ISTR_DOVR)
  if (wIstr & ISTR_DOVR & wInterrupt_Mask)
  {
#ifdef USB_DEBUG
	debug_printf("\nGoing to call ISTR_DOVR\n\r");
#endif	
    _SetISTR((uint16_t)CLR_DOVR);
#ifdef DOVR_CALLBACK
    DOVR_Callback();
#endif
  }
#endif
  /*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*/
#if (IMR_MSK & ISTR_ERR)
  if (wIstr & ISTR_ERR & wInterrupt_Mask)
  {
#ifdef USB_DEBUG
	debug_printf("\nGoing to call ISTR_ERR\n\r");
#endif	
    _SetISTR((uint16_t)CLR_ERR);
#ifdef ERR_CALLBACK
    ERR_Callback();
#endif
  }
#endif
  /*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*/
#if (IMR_MSK & ISTR_WKUP)
  if (wIstr & ISTR_WKUP & wInterrupt_Mask)
  {
 #ifdef USB_DEBUG
	debug_printf("\nGoing to call ISTR_WKUP\n\r");
#endif	
    _SetISTR((uint16_t)CLR_WKUP);
    //Resume(RESUME_EXTERNAL);
#ifdef WKUP_CALLBACK
    WKUP_Callback();
#endif
  }
#endif
  /*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*/
#if (IMR_MSK & ISTR_SUSP)
  if (wIstr & ISTR_SUSP & wInterrupt_Mask)
  {
#ifdef USB_DEBUG
	debug_printf("\nGoing to call SUSPEND\n\r");
#endif	
    /* check if SUSPEND is possible */
    //if (fSuspendEnabled)
    //{
    //  Suspend();
    //}
    //else
    //{
    //  /* if not possible then resume after xx ms */
    //  Resume(RESUME_LATER);
    //}
    /* clear of the ISTR bit must be done after setting of CNTR_FSUSP */
    _SetISTR((uint16_t)CLR_SUSP);
//#ifdef SUSP_CALLBACK
  //  SUSP_Callback();
//#endif
  }
#endif
  /*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*/
//#if (IMR_MSK & ISTR_SOF)
  if (wIstr & ISTR_SOF & wInterrupt_Mask)
  {
#ifdef USB_DEBUG
	debug_printf("\nGoing to call Start of Frame\n\r");
#endif	
    _SetISTR((uint16_t)CLR_SOF);
    bIntPackSOF++;

//#ifdef SOF_CALLBACK
    //SOF_Callback();
//#endif
  }
//#endif
  /*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*/
//#if (IMR_MSK & ISTR_ESOF)
  if (wIstr & ISTR_ESOF & wInterrupt_Mask)
  {
#ifdef USB_DEBUG
	debug_printf("\nGoing to call End of Start Frame\n\r");
#endif	
    _SetISTR((uint16_t)CLR_ESOF);
    /* resume handling timing is made with ESOFs */
    //Resume(RESUME_ESOF); /* request without change of the machine state */

//#ifdef ESOF_CALLBACK
    //ESOF_Callback();
//#endif
  }
//#endif
}
